class Demo4For {
	/*
	 需求：在控制台输出所有的”水仙花数”

	* 所谓的水仙花数是指一个三位数，其各位数字的立方和等于该数本身。
	* 举例：153就是一个水仙花数。
	* 153 = 1*1*1 + 5*5*5 + 3*3*3 = 1 + 125 + 27 = 153

	分析:
	1,是三位数,三位数的范围是100到999
	2,获取每个位上的数字
	3,求每个位上数字立方和并且与变化的变量进行判断,如果相等打印这个数
	*/
	public static void main(String[] args) {
		for (int x = 100;x < 1000 ;x++ ) {
			int ge = x % 10;			//153 % 10 = 3
			int shi = x / 10 % 10;		//153 / 10 = 15 % 10 = 5
			int bai = x / 10 / 10 % 10;//153 / 10 = 15 / 10 = 1 % 10 = 1

			if (ge * ge * ge + shi * shi * shi + bai * bai * bai == x ) {
				System.out.println(x);
			}
		}
	}
}
